INSERT INTO notification (id,
                   type_id,
                   sent_time,
                   person_id,
                   entity_id,
                   contact)
VALUES
        ('1', '2', '2023-12-26 14:05', '10002', '1000', 'bmetz@gmail.com', FALSE),
        ('2', '2', '2023-12-26 14:15', '10003', '1000', 'shayne75@fay.com', FALSE),
        ('3', '2', '2023-12-26 14:25', '10004', '1000', 'iblock@hotmail.com', FALSE),
        ('4', '2', '2023-12-26 14:35', '10005', '1000', 'ernie04@heller.biz', FALSE),
        ('5', '2', '2023-12-26 14:45', '10006', '1000', 'beth.kunde@yahoo.com', FALSE),
        ('6', '2', '2023-12-26 14:55', '10007', '1000', 'toney39@berge.net', FALSE),
        ('7', '2', '2023-12-26 15:05', '10008', '1000', 'yhickle@nikolaus.com', FALSE),
        ('8', '2', '2023-12-26 16:05', '10009', '1000', 'aufderhar.cary@harber.com', FALSE),
        ('9', '2', '2023-12-26 17:05', '10010', '1000', 'xwiegand@hotmail.com', FALSE),
        ('10', '2', '2023-12-26 16:05', '10001', '1001', 'thuel@yahoo.com', FALSE),
        ('11', '2', '2023-12-26 14:45', '10001', '1003', 'thuel@yahoo.com', FALSE),
        ('12', '2', '2023-12-26 14:55', '10001', '1004', 'thuel@yahoo.com', FALSE),
        ('13', '2', '2023-12-26 15:05', '10001', '1005', 'thuel@yahoo.com', FALSE),
        ('14', '2', '2023-12-26 16:05', '10001', '1006', 'thuel@yahoo.com', FALSE),
        ('15', '2', '2023-12-26 17:05', '10001', '1007', 'thuel@yahoo.com', FALSE),
        ('16', '2', '2023-12-26 16:05', '10001', '1008', 'thuel@yahoo.com', FALSE),
        ('17', '2', '2023-12-26 14:05', '10001', '1009', 'thuel@yahoo.com', FALSE);

--------

INSERT INTO message (id,
                   time,
                   author_id,
                   recipient_id,
                   message_text,
                   read_status)
VALUES
        ('1', '2023-12-26 14:05', '10002', '10001', 'Текст сообщения ... 1', 'SENT'),
        ('2', '2023-12-26 14:15', '10002', '10001', 'Текст сообщения ... 2', 'SENT'),
        ('3', '2023-12-26 14:25', '10002', '10001', 'Текст сообщения ... 3', 'SENT'),
        ('4', '2023-12-26 14:35', '10002', '10001', 'Текст сообщения ... 4', 'SENT'),
        ('5', '2023-12-26 14:45', '10002', '10001', 'Текст сообщения ... 5', 'SENT'),
        ('6', '2023-12-26 14:55', '10002', '10001', 'Текст сообщения ... 6', 'SENT');

--------

INSERT INTO post_like (id,
                   time,
                   person_id,
                   post_id)
VALUES
        ('1', '2023-12-26 14:05', '10002', '1'),
        ('2', '2023-12-26 14:15', '10002', '2'),
        ('3', '2023-12-26 14:25', '10002', '3'),
        ('4', '2023-12-26 14:35', '10002', '4'),
        ('5', '2023-12-26 14:45', '10002', '5'),
        ('6', '2023-12-26 14:55', '10002', '6'),
        ('7', '2023-12-26 15:05', '10002', '7'),
        ('8', '2023-12-26 16:05', '10002', '8'),
        ('9', '2023-12-26 17:05', '10002', '9'),
        ('10', '2023-12-26 16:05', '10002', '10');

--------

INSERT INTO post_comment (id,
                   time,
                   post_id,
                   parent_id,
                   author_id,
                   comment_text,
                   is_blocked)
VALUES
        ('1', '2023-12-26 14:05', '1', NULL, '10002', 'Текст комментария ... 1', FALSE),
        ('2', '2023-12-26 14:15', '2', NULL, '10002', 'Текст комментария ... 2', FALSE),
        ('3', '2023-12-26 14:25', '3', NULL, '10002', 'Текст комментария ... 3', FALSE),
        ('4', '2023-12-26 14:35', '4', NULL, '10002', 'Текст комментария ... 4', FALSE),
        ('5', '2023-12-26 14:45', '5', NULL, '10002', 'Текст комментария ... 5', FALSE),
        ('6', '2023-12-26 14:55', '6', NULL, '10002', 'Текст комментария ... 6', FALSE),
        ('7', '2023-12-26 15:05', '7', NULL, '10002', 'Текст комментария ... 7', FALSE),
        ('8', '2023-12-26 16:05', '8', NULL, '10002', 'Текст комментария ... 8', FALSE),
        ('9', '2023-12-26 17:05', '9', NULL, '10002', 'Текст комментария ... 9', FALSE),
        ('10', '2023-12-26 16:05', '10', NULL, '10002', 'Текст комментария ... 10', FALSE);

-------

COMMIT;